{
  "listings": [
    {
      "path": "/assets/posts/arriving_in_amsterdam/post.md",
      "description": "The first day of my travels. Bags have been packed, cats are with a friend, said my goodbyes -- I'm all set. A 7-hour redeye flight to Iceland followed by a 3-hour flight to Amsterdam. An easy pass through customs and I've officially arrived. Amsterdam. The first stop on what is supposed to be a year-long journey around the world. It's a bustling city renowned for its beautiful canals and lively atmosphere. It's a cultural hub where 90+% of the residents there speak English and you can go just about anywhere in the city using public transit or by bike. In other words, it's the perfect first stop for an inexperienced traveler like myself. My name's Rob. I am a 27-year-old American and I'm planning on traveling the world for a year.",
      "title": "Arriving In Amsterdam",
      "author": "Robert Allen",
      "date": "09-26-2022",
      "heroImageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj5UkXSsuvCzPnUY5kqFPe5Oe2mvR3qK92Y1-Rt_z2K4HrNTBh7bGpV7I-hd2_0XkJqXpsd9HJg9YPcOfuiAEh503IMEU2cq1DlAvgMzvekx-GkKOb6dPBKHyjL66wROyptqNsAOhCEdX5TEeZBjWy0qrnwKmOLXIcIE0Bg-Xkp_5_YRouEY91ppnjO/w640-h480/20220930_120718.jpg"
    },
    {
      "path": "/assets/posts/flying_pigs/post.md",
      "description": "I'm staying in Amsterdam for a whole month. As part of that, I decided to jump from hostel to hostel to see more of the city. This next hostel, called the Flying Pig Downtown, is owned by the same company as The Winston where I last stayed. It's a much bigger hostel than the previous one and I was in a room with 14 beds. A big jump up from the six beds in my last room. It's quite a different experience from my last hostel. There's much less of a community within the rooms as most occupants avoid speaking to each other.",
      "title": "Flying Pigs -- Amsterdam",
      "author": "Robert Allen",
      "date": "10-15-2022",
      "heroImageUrl": "https://barstalker.de/wp-content/uploads/2022/03/Mayaimi-Vice.jpg"
    },
    {
      "path": "/assets/posts/venice/post.md",
      "description": "After Cinque Terre, I was off to Venice. I stayed at a hostel on the mainland outside Venice, only a 10-minute train ride to Venice proper. I made it my workstation for a couple of days, socializing with my fellow travelers but keeping it light as I worked throughout the week. I made a promise to myself to socialize more properly once the weekend came around.",
      "title": "Venice",
      "author": "Robert Allen",
      "date": "11-05-2022",
      "heroImageUrl": "/posts/venice/dating_profile_pic.webp"
    },
    {
      "path": "/assets/posts/florence_naples_pompeii/post.md",
      "description": "After my fantastic stay in Venice, I was off to Florence. After asking my hostel mates, I learned the main things to do in Florence were to see The David and have a Florentine steak. The Florentine steak, for those unaware, is a massive \"3-finger thick\" slab of steak. Exclusively sold by the kg, enjoying one is not a cheap affair.",
      "title": "Florence, Naples, and Pompeii",
      "author": "Robert Allen",
      "date": "11-20-2022",
      "heroImageUrl": "/posts/florence_naples_pompeii/santa_maria_del_fiore.webp"
    },
    {
      "path": "/assets/posts/hello_italy/post.md",
      "description": "After nearly 30 days in the Netherlands, it was time to move on. Amsterdam was an excellent place to start my journey. Friendly people, high English proficiency everywhere, fun and interesting culture. However, it was time to move on to the next destination and see what that new place would offer.",
      "title": "Hello Italy",
      "author": "Robert Allen",
      "date": "11-01-2022",
      "heroImageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6_THCiKum2B4wzXURrHw2HC0cqmAAn1M8kVOBXdJkUyN7J2Yl6S4pweemDSaSeF8T87twX1bDzWMx_zZ4FWdi4bi4RvW2if4FuJEYj-CA69dvHfZlLoGmPfqOr4zwkrN2raWe1SPu2w7Sg7A94lHO98FzzI8GajAfwQSrsNVoHhRDNoiwvenZ9ayV/w640-h480/20221026_212440.jpg"
    },
    {
      "path": "/assets/posts/st_christophers_at_the_winston/post.md",
      "description": "St. Christophers at the Winston was the name of the new hostel I stayed at after my stay in my private room. Immediately upon going to my room I learned about another interesting quirk about the Netherlands and that is their stairs. The stairs throughout the Netherlands are in general very steep. They can be quite narrow and hazardous and they seem like quite a hazard to bring luggage up. You'd think it would be impossible to move in and out of places but the dutch are smart. Most of the places in Amsterdam have a hook hanging over the street from the roof where a rope can be used as a pulley. Then using their large windows people can easily move furniture in and out and avoid the hazardous stairs.",
      "title": "St. Christophers at the Winston -- Amsterdam",
      "author": "Robert Allen",
      "date": "10-08-2022",
      "heroImageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh3EtwjrEWgTgVw1e_Ao6uxNTmMEd-i4bVAfF7EiuteUY328iuEbPT23dNKMBFDoypv2v7U01ctFzhC9c-7JpRQ4nyc9J5M68lyUtgdHmciGIXlxGxM5UOPwT2GxPQyx3PbSPyyPQF53_umkCcK0BiZgS39qU_odupai7m8bRy7Aewc58HQSJ9Mto8t/w640-h480/IMG-20221004-WA0008.jpg"
    },
    {
      "path": "/assets/posts/the_hague/post.md",
      "description": "After staying in Amsterdam, I wanted to mix things up by visiting somewhere else in the Netherlands. I settled upon The Hague due to rumors of its good nightlife. Rotterdam was a strong contender, but the main attraction there was its architecture which wasn't a big draw for me.",
      "title": "The Hague",
      "author": "Robert Allen",
      "date": "10-23-2022",
      "heroImageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg9Q_3DDe4ZPnN_e7VbZpBw6rkW65pAvJR9QNblb3nS7qMgq6EurrL6DqBoE-lngrybyKoa-PC7S_yP71UPrpMtOCu4j6oa-69ifHF1RD9u5ASY_xLErgfLYAhXRXNTet3_2dwL-k-y8tkeKsCseCr3ELZw8wt9IEOo8n8XlbUJ7EI5P-hBgIJoTmZx/s320/20221019_112825.jpg"
    },
    {
      "path": "/assets/posts/thailand_qatar/post.md",
      "description": "After my trip to Pompeii, I took a train to Rome to catch my flight. Unfortunately, there would be no time to explore the city this time around. I was off to Thailand. First though, I had a 5-hour layover in Qatar. I hadn't planned this and had booked the tickets far in advance, but I was going to be right in the action as the biggest sporting event in the world was going on -- the world cup.",
      "title": "Thailand + Layover in Qatar",
      "author": "Robert Allen",
      "date": "11-30-2022",
      "heroImageUrl": "/posts/thailand_qatar/lubd_grafitti.webp"
    },
    {
      "path": "/assets/posts/thailands_islands_and_chiang_mai/post.md",
      "description": "I'd heard many great things about Thailand's islands and was eager to see a few of them myself. I scheduled a tour that included everything - transportation, breakfast, lunch, snorkeling, and swimming in some of the most beautiful spots around the islands.",
      "title": "Thailand's Islands + Chiang Mai",
      "author": "Robert Allen",
      "date": "12-07-2022",
      "heroImageUrl": "/posts/thailands_islands_and_chiang_mai/koh_phi_phi_don_bay.webp"
    },
    {
      "path": "/assets/posts/cambodia/post.md",
      "description": "After a full day of travel, I was off to Cambodia. My first stop was Phnom Peng, the capital. It was a long day of travel. I had to fly first to Bangkok and then to Phnom Peng with a 3-hour layover in between.",
      "title": "Cambodia",
      "author": "Robert Allen",
      "date": "12-21-2022",
      "heroImageUrl": "/posts/cambodia/angkor_wat_side.webp"
    },
    {
      "path": "/assets/posts/vietnam/post.md",
      "description": "From Cambodia, I had a long journey to get to Vietnam. Vietnam is restrictive. My visa indicated I needed to enter the country from a certain point. I had made a bit of a mistake and chosen an entry point out of the way from where I was after my stay on the island of Koh Rohn. It would take two days of travel: a ferry ride, a very bumpy bus ride, and a separate 7-hour bus ride with no English speakers across the Vietnam border before I finally arrived in Ho Chi Minh.",
      "title": "Vietnam",
      "author": "Robert Allen",
      "date": "01-06-2023",
      "heroImageUrl": "/posts/vietnam/hoi_an_river_night.webp"
    },
    {
      "path": "/assets/posts/laos/post.md",
      "description": "Upon arriving in Laos from Hanoi, Vietnam, on a small airplane, I was met with a slight hiccup at customs. Although I had a visa, it turned out that there was additional paperwork required. As I received the forms, I realized I didn't have a pen to fill them out. Fortunately, a kind couple nearby lent me one, and I was able to complete the forms and clear customs without any further issues.",
      "title": "Laos",
      "author": "Robert Allen",
      "date": "01-12-2023",
      "heroImageUrl": "/posts/laos/waterfall_2.webp"
    },
    {
      "path": "/assets/posts/singapore/post.md",
      "description": "From the moment I arrived in Singapore, I was struck by the city's modernity. After disembarking from my flight, I headed straight for the train to travel to my hostel in Chinatown. I used my phone to swipe through the train station gates, a small thing that struck me as impressively modern. This place offered a stark contrast to the less modern countries I'd visited previously.",
      "title": "Singapore",
      "author": "Robert Allen",
      "date": "01-19-2023",
      "heroImageUrl": "/posts/singapore/chinatown.webp"
    },
    {
      "path": "/assets/posts/bali/post.md",
      "description": "TODO FILL ME IN",
      "title": "Bali",
      "author": "Robert Allen",
      "date": "02-02-2023",
      "heroImageUrl": "/posts/bali/sunset_01.webp"
    }
  ]
}
